In [2]:
import pandas as pd

In [3]:
titanic = pd.read_csv("/Users/jonahschrager/Desktop/Python /train_and_test.csv")
titanic.head()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [4]:
titanic["Age"].mean()

29.50318563789152

In [5]:
titanic[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [6]:
titanic[["Age", "Fare"]].describe()

               Age         Fare
count  1309.000000  1309.000000
mean     29.503186    33.281086
std      12.905241    51.741500
min       0.170000     0.000000
25%      22.000000     7.895800
50%      28.000000    14.454200
75%      35.000000    31.275000
max      80.000000   512.329200

In [7]:
titanic.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age        Fare
max     80.000000  512.329200
mean          NaN   33.281086
median  28.000000   14.454200
min      0.170000    0.000000
skew     0.540987         NaN

In [8]:
titanic[["Sex", "Age"]].groupby("Sex").mean()

           Age
Sex
0    30.017888
1    28.572082

In [9]:
titanic.groupby("Sex").mean()

,Passengerid,Age,Fare,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
Sex,,,,,,,,,,,,,,,,,,,,,
0,658.766311,30.017888,26.140721,0.413998,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.372479,0.0,0.0,1.552788,0.0,0.0,0.1293
1,648.186695,28.572082,46.198097,0.652361,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.154506,0.0,0.0,1.383621,0.0,0.0,0.5000

In [10]:
titanic.groupby("Sex")["Age"].mean()

Sex
0    30.017888
1    28.572082
Name: Age, dtype: float64

In [11]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex  Pclass
0    1          69.888385
     2          19.904946
     3          12.419597
1    1         109.412385
     2          23.234827
     3          15.324250
Name: Fare, dtype: float64

In [12]:
titanic["Pclass"].value_counts()

3    709
1    323
2    277
Name: Pclass, dtype: int64

In [13]:
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    323
2    277
3    709
Name: Pclass, dtype: int64